# user/bin/env/py3
# 这个程序是面向像我一样有在短时间内生成大量名字需求的创作者使用的
# 生成过程全部为计算机随机,我曾在一次测试中生成过"乔峰"
# 不过,对于男女主的名字,我建议自己创造一个"别急匠心"的名字.

from random import choice, randint

sex = 0  # 控制性别
mode = 2  # 控制生成名字模式,1为全男,2为全女,其他数字为随机
T_name = ''
F_name = ''
F_list = ['赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨', '朱', '秦',
          '尤', '许', '何', '吕',
          '施', '张', '孔', '曹', '严', '华', '金', '魏', '陶', '姜', '戚', '谢', '邹', '柏', '窦', '章', '云', '苏',
          '潘', '范', '彭', '鲁',
          '韦', '马', '苗', '任', '袁', '柳', '史', '唐', '费', '薛', '贺', '汤', '罗', '郝', '常', '乐', '于', '卞',
          '齐', '康', '伍', '余',
          '元', '顾', '孟', '黄', '穆', '萧', '尹', '姚', '邵', '湛', '汪', '祁', '毛', '禹', '狄', '戴', '宋', '庞',
          '熊', '虞', '万', '高',
          '夏', '蔡', '田', '杜', '董', '丁', '邓', '林', '刁', '钟', '徐', '梁', ]
G_name = ''
G_list0 = ['筠', '柔', '竹', '霭', '凝', '晓', '欢', '霄', '枫', '芸', '菲', '寒', '伊', '亚', '宜', '可', '姬', '舒',
           '影', '荔', '枝', '思',
           '丽', '秀', '娟', '英', '华', '慧', '巧', '美', '娜', '静', '淑', '惠', '珠', '翠', '雅', '芝', '玉', '萍',
           '红', '娥', '玲', '芬',
           '芳', '燕', '彩', '春', '菊', '勤', '珍', '贞', '莉', '兰', '凤', '洁', '梅', '琳', '素', '云', '莲', '真',
           '环', '雪', '荣', '爱',
           '妹', '霞', '香', '月', '莺', '媛', '艳', '瑞', '凡', '佳', '嘉', '琼', '桂', '娣', '叶', '璧', '璐', '娅',
           '琦', '晶', '妍', '茜',
           '秋', '珊', '莎', '锦', '黛', '青', '倩', '婷', '姣', '婉', '娴', '瑾', '颖', '露', '瑶', '怡', '婵', '雁',
           '蓓', '纨', '仪', '荷',
           '丹', '蓉', '眉', '君', '琴', '蕊', '薇', '菁', '梦', '岚', '苑', '婕', '馨', '瑗', '琰', '韵', '融', '园',
           '艺', '咏', '卿', '聪',
           '澜', '纯', '毓', '悦', '昭', '冰', '爽', '琬', '茗', '羽', '希', '宁', '欣', '飘', '育', '滢', '馥', '飞',
           '智', '睿', ]
G_list1 = ['梁', '栋', '维', '启', '克', '伦', '翔', '旭', '鹏', '泽', '晨', '辰', '士', '以', '建', '家', '致', '树',
           '炎', '盛', '雄', '琛',
           '钧', '冠', '策', '腾', '楠', '榕', '风', '航', '弘', '义', '兴', '良', '飞', '彬', '富', '和', '鸣', '朋',
           '斌', '行', '时', '泰',
           '博', '磊', '民', '友', '志', '清', '坚', '庆', '若', '德', '彪', '伟', '刚', '勇', '毅', '俊', '峰', '强',
           '军', '平', '保', '东',
           '文', '辉', '力', '明', '永', '健', '世', '广', '海', '山', '仁', '波', '宁', '福', '生', '龙', '元', '全',
           '国', '胜', '学', '祥',
           '才', '发', '武', '新', '利', '顺', '信', '子', '杰', '涛', '昌', '成', '康', '星', '光', '天', '达', '安',
           '岩', '中', '茂', '进',
           '林', '有', '诚', '先', '敬', '震', '振', '壮', '会', '思', '群', '豪', '心', '邦', '承', '乐', '绍', '功',
           '松', '善', '厚', '裕',
           '瑞', '智', '睿', ]


def family_nane():
    global F_name, sex
    if mode == 1:
        sex = 1
    elif mode == 2:
        sex = 2
    else:
        sex = randint(1, 2)
    F_name = choice(F_list)


def given_name():
    global G_name
    i = 0
    G_name = ''
    name_length = randint(1, 2)
    for i in range(name_length):
        if sex == 2:
            G_name = G_name + choice(G_list0)
        elif sex == 1:
            G_name = G_name + choice(G_list1)

    return G_name


def spawn():
    global T_name, a
    family_nane()
    given_name()

    a = ''
    T_name = F_name + G_name
    if sex == 2:
        a = '女'
    elif sex == 1:
        a = '男'

    return T_name


def what_sex():
    if sex == 2:
        return '女'
    elif sex == 1:
        return '男'


if __name__ == '__main__':
    i = 0
    while i != 10:
        print(spawn(), end=',')
        print(what_sex())
        i += 1
